app/controllers/surveys_controller.rb

  def create
    #if the from is submitted and the params object is not nil then save the survey object to database
    if request.post? and params[:survey]
      @survey = Survey.new(params[:survey])

      @programs = @survey.find_eligible_programs

      @survey.ip_addr = request.remote_ip

      if @survey.save
---
SELECT * FROM `programs` WHERE ((fpl_max < 0 AND smi_max < 0 AND annual_income_max < 0) OR (fpl_max > 0 AND fpl_max >= 0.457585357268567) OR (smi_max > 0 AND smi_max >= 0.105533186128069) OR (annual_income_max > 0 AND annual_income_max >= 13000.0)) ORDER BY name
INSERT INTO `surveys` (`have_a_spouse`, `other_income_amt`, `updated_at`, `age`, `other_income`, `net_income_amt`, `ip_addr`, `adult_dependants`, `net_income_frequency`, `children_under_18`, `children_under_13`, `created_at`, `spouse_currently_employed`, `resident_of_CT`, `adult_disability`, `currently_employed`, `tax_filing_method_id`, `approved_training_activity`, `spouse_net_income_amt`, `other_income_frequency`, `residency_id`, `children_under_5`, `pregnant`, `spouse_approved_training_activity`, `spouse_net_income_frequency`, `programs`) VALUES(1, NULL, '2017-03-21 21:11:16', 25, 2, 13000.0, '192.168.136.1', 0, 1, 3, NULL, '2017-03-21 21:11:16', 2, 1, 2, 1, 3, NULL, 0.0, NULL, 1, 1, 2, 1, 1, '1 2 3 6 7 21 22 20 19 18')